app/controllers/dealers_controller.rb

SELECT "dealers".* FROM "dealers"
---
    def index
        dealers = Dealer.all