app/controllers/dealer_hands_controller.rb

SELECT "dealer_hands".* FROM "dealer_hands"
---
    def index
        dealer_hands = DealerHand.all

INSERT INTO "dealer_hands" ("dealer_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["dealer_id", 4], ["game_id", 21], ["created_at", "2021-04-23 15:21:01.921986"], ["updated_at", "2021-04-23 15:21:01.921986"]]
---
    def create
        dealer_hand = DealerHand.create({user_id: params[:user_id],game_id: params[:game_id]})