app/controllers/games_controller.rb

    def index
        games = Game.all
---
SELECT "games".* FROM "games"

    def create
        game = Game.create({min_bet: params[:min_bet], max_bet: params[:max_bet]})
---
INSERT INTO "games" ("min_bet", "max_bet", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["min_bet", 1], ["max_bet", 10], ["created_at", "2021-04-23 14:45:25.644832"], ["updated_at", "2021-04-23 14:45:25.644832"]]