app/controllers/users_controller.rb

    def create
        user = User.create({picture:params[:picture],name:params[:name],password:params[:password],tokens:params[:tokens]})
---
INSERT INTO "users" ("name", "password", "tokens", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
        user = User.find_by(id: params[:id])
        user.update({picture:params[:picture],name:params[:name],password:params[:password]})
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password" = ?, "tokens" = ?, "picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", nil], ["password", nil], ["tokens", 1000010], ["picture", nil], ["updated_at", "2021-04-22 21:31:00.171928"], ["id", 8]]

    def destroy
        user = User.find_by(id: params[:id])
        render json: UserSerializer.new(user)
        user.delete
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]