app/controllers/user_hands_controller.rb

INSERT INTO "user_hands" ("bet", "user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["bet", 10], ["user_id", 31], ["game_id", 15], ["created_at", "2021-04-23 15:02:20.434434"], ["updated_at", "2021-04-23 15:02:20.434434"]]
---
    def create
        user_hand = UserHand.create({bet: params[:bet],user_id: params[:user_id],game_id: params[:game_id]})